tests/load/artillery-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 120
      arrivalRate: 50
    - duration: 60
      arrivalRate: 100
scenarios:
  - name: "Platform Admin Load Test"
    requests:
      - get:
          url: "/api/platform-admin/health"
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@platform.com"
            password: "test123"